{"config": {"name": "sequential_9", "layers": [{"config": {"name": "conv2d_22_input", "dtype": "float32", "sparse": false, "ragged": false, "batch_input_shape": [null, 1, 16, 8]}, "class_name": "InputLayer"}, {"config": {"name": "conv2d_22", "data_format": "channels_last", "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "groups": 1, "dtype": "float32", "filters": 128, "strides": [1, 1], "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 2], "batch_input_shape": [null, 1, 16, 8]}, "class_name": "Conv2D"}, {"config": {"name": "activation_31", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_22", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "dtype": "float32", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_14", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_23", "data_format": "channels_last", "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "groups": 1, "dtype": "float32", "filters": 128, "strides": [1, 1], "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 2]}, "class_name": "Conv2D"}, {"config": {"name": "activation_32", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_23", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "dtype": "float32", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_15", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_24", "data_format": "channels_last", "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "groups": 1, "dtype": "float32", "filters": 128, "strides": [1, 1], "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 2]}, "class_name": "Conv2D"}, {"config": {"name": "activation_33", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_24", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "dtype": "float32", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_16", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_9", "dtype": "float32", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_18", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 128, "kernel_constraint": null, "batch_input_shape": [null, 512]}, "class_name": "Dense"}, {"config": {"name": "activation_34", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_19", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 2, "kernel_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.4.0"}